//! Роширення подій (event propagation) - включає в себе 3 важливиї події (затоплення -> таргетінг -> спливання)

//? Capture phase - подія яка починаеється на window  і тоне (проходить через всі вузли-нащадки) до самого глибокого цільового елемента де сталася подія
//? Tagret phase - подія дошла до самого шдибокого цільового елемента. тільки повідомлення вузла на якім сталася подія
//? Bubbling phase - заключающаяся фаза, подія спливає  від самого нлибокого елемента через всі вузли-нащадки до window
