// ! DOM - Document, Object, Model
//* міжплатформений незалежний від мови інтерфейс для роботи з HTML-док
//* набір властивостей і методів дозволяющіх шукати, створювати і видаляти
//* елементи та реагувати на дії коирстувача.
// ! BOM - Browser Object Model - працює з браузером, з владинкою.

//? DOM-модель - те це кожний окремий елемент-вузел
//? - кожний фрагмент тексту - текстовий елемент

const div = document.querySelector(".div-el");
div.classList.add("this");
div.innerText = "another text";
div.style.backgroundColor = "red";
console.dir(div);
const divTag = document.querySelector("div");
console.log("🚀 ~ divTag:", divTag);

//! Навігація по DOM-u
//? Терміни:
//? - ancestor (пращюр)
//? - descendant (потомок)
//? - parent (батько)
//? - child (дитина)
//? - sibling (сусід)

//* Відносити вузлів
//* в дереві вузлів верзній вузол називається корневим (root node)
//* кожний вузол крім root node, має тільки одного батька
//* у вузла може бути скільки завгодно дітей
//* сусіди - це вузли з загальним батьком
//* дочірні елементи (діти) - елементи які ліжать безпосередгбо всередині данного батька
//* потомки - всі елементи, які ліжать всередині даного батька разом з їхніми
//* дітьми, дітьми їх дітей і так далі
// (картинка)

//! Пошук по DOM-вузлах

//? Метод elem.querySelector(selector) - шукає 1 елемент

//? Метод elem.querySelectorAll(selector) - шукає більше 1 елемента (буде псевдомассив)
